clc;clear;close all;
%% 0.1. 定义系统参数
s = tf('s');

% 这里作为例子可能不太合适，这是example2.24，而2.24是直接给出\tilde{G}_{d}(s,\Delta)
% 修正传递函数定义（根据文献精确表达式）
% G1 = (1/pi * s)/(s + 2*pi)^2;      % G1 = (1/π * s)/(s+2π)²
% G2 = (1/(10*pi) * s)/(s + 20*pi)^2; % G2 = (1/10π * s)/(s+20π)²  
% G3 = (1/(100*pi) * s)/(s + 200*pi)^2; % G3 = (1/100π * s)/(s+200π)²

% 可能就是单纯写错了？
G1 = 0.36*100*(1/(1*pi )* s)/(s + 2*pi)^2;  
G2 = 0.36*100*(10/(1*pi) * s)/(s + 20*pi)^2; 
G3 = 0.36*100*(100/(1*pi) * s)/(s + 200*pi)^2; 
Gu_s0 = 7*G1*0.25 + 3*G2*1 + 3*G3*0.75;
bode(Gu_s0)



